zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32l1xx/drivers/include/stm32l1xx_ll_comp.h
/** @defgroup COMP_LL_EC_INPUT_MINUS Comparator inputs - Input minus (input inverting) selection
  * @{
  */
#define LL_COMP_INPUT_MINUS_1_4VREFINT  (COMP_CSR_INSEL_2                    | COMP_CSR_INSEL_0) /*!< Comparator input minus connected to 1/4 VrefInt (specific to COMP instance: COMP2) */
#define LL_COMP_INPUT_MINUS_1_2VREFINT  (COMP_CSR_INSEL_2                                      ) /*!< Comparator input minus connected to 1/2 VrefInt (specific to COMP instance: COMP2) */
#define LL_COMP_INPUT_MINUS_3_4VREFINT  (                   COMP_CSR_INSEL_1 | COMP_CSR_INSEL_0) /*!< Comparator input minus connected to 3/4 VrefInt (specific to COMP instance: COMP2) */
#define LL_COMP_INPUT_MINUS_VREFINT     (                   COMP_CSR_INSEL_1                   ) /*!< Comparator input minus connected to VrefInt */
#define LL_COMP_INPUT_MINUS_DAC1_CH1    (COMP_CSR_INSEL_2 | COMP_CSR_INSEL_1                   ) /*!< Comparator input minus connected to DAC1 channel 1 (DAC_OUT1) (specific to COMP instance: COMP2) */
#define LL_COMP_INPUT_MINUS_DAC1_CH2    (COMP_CSR_INSEL_2 | COMP_CSR_INSEL_1 | COMP_CSR_INSEL_0) /*!< Comparator input minus connected to DAC1 channel 2 (DAC_OUT2) (specific to COMP instance: COMP2) */
#define LL_COMP_INPUT_MINUS_IO1         (                                      COMP_CSR_INSEL_0) /*!< Comparator input minus connected to IO1 (pin PB3 for COMP2) (specific to COMP instance: COMP2) */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_PULLING_RESISTOR Comparator input - Pulling resistor
  * @{
  */
#define LL_COMP_INPUT_MINUS_PULL_NO        (0x00000000U)           /*!< Comparator input minus not connected to any pulling resistor */
#define LL_COMP_INPUT_MINUS_PULL_UP_10K    (COMP_CSR_10KPU)        /*!< Comparator input minus connected to pull-up resistor of 10kOhm (specific to COMP instance: COMP1) */
#define LL_COMP_INPUT_MINUS_PULL_UP_400K   (COMP_CSR_400KPU)       /*!< Comparator input minus connected to pull-up resistor of 400kOhm (specific to COMP instance: COMP1) */
#define LL_COMP_INPUT_MINUS_PULL_DOWN_10K  (COMP_CSR_10KPD)        /*!< Comparator input minus connected to pull-down resistor of 10kOhm (specific to COMP instance: COMP1) */
#define LL_COMP_INPUT_MINUS_PULL_DOWN_400K (COMP_CSR_400KPD)       /*!< Comparator input minus connected to pull-down resistor of 400kOhm (specific to COMP instance: COMP1) */

/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_SELECTION Comparator output - Output selection
  * @{
  */
#define LL_COMP_OUTPUT_NONE             (COMP_CSR_OUTSEL_2 | COMP_CSR_OUTSEL_1 | COMP_CSR_OUTSEL_0) /*!< COMP output is not connected to other peripherals (except GPIO and EXTI that are always connected to COMP output) (specific to COMP instance: COMP2) */
#define LL_COMP_OUTPUT_TIM2_IC4         (0x00000000)                                                /*!< COMP output connected to TIM2 input capture 4  (specific to COMP instance: COMP2) */
#define LL_COMP_OUTPUT_TIM2_OCREFCLR    (                                        COMP_CSR_OUTSEL_0) /*!< COMP output connected to TIM2 OCREF clear      (specific to COMP instance: COMP2) */
#define LL_COMP_OUTPUT_TIM3_IC4         (                    COMP_CSR_OUTSEL_1                    ) /*!< COMP output connected to TIM3 input capture 4  (specific to COMP instance: COMP2) */
#define LL_COMP_OUTPUT_TIM3_OCREFCLR    (                    COMP_CSR_OUTSEL_1 | COMP_CSR_OUTSEL_0) /*!< COMP output connected to TIM3 OCREF clear      (specific to COMP instance: COMP2) */
#define LL_COMP_OUTPUT_TIM4_IC4         (COMP_CSR_OUTSEL_2                                        ) /*!< COMP output connected to TIM4 input capture 4  (specific to COMP instance: COMP2) */
#define LL_COMP_OUTPUT_TIM4_OCREFCLR    (COMP_CSR_OUTSEL_2                     | COMP_CSR_OUTSEL_0) /*!< COMP output connected to TIM4 OCREF clear      (specific to COMP instance: COMP2) */
#define LL_COMP_OUTPUT_TIM10_IC1        (COMP_CSR_OUTSEL_2 | COMP_CSR_OUTSEL_1                    ) /*!< COMP output connected to TIM10 input capture 1 (specific to COMP instance: COMP2) */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_LEVEL Comparator output - Output level
  * @{
  */
#define LL_COMP_OUTPUT_LEVEL_LOW        (0x00000000U) /*!< Comparator output level low (if the polarity is not inverted, otherwise to be complemented) */
#define LL_COMP_OUTPUT_LEVEL_HIGH       (0x00000001U) /*!< Comparator output level high (if the polarity is not inverted, otherwise to be complemented) */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_HW_DELAYS  Definitions of COMP hardware constraints delays
  * @note   Only COMP IP HW delays are defined in COMP LL driver driver,
  *         not timeout values.
  *         For details on delays values, refer to descriptions in source code
  *         above each literal definition.
  * @{
  */

/* Delay for comparator startup time.                                         */
/* Note: Delay required to reach propagation delay specification.             */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tSTART").                                                       */
/* Unit: us                                                                   */
#define LL_COMP_DELAY_STARTUP_US          (25U)  /*!< Delay for COMP startup time */


/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup COMP_LL_Exported_Macros COMP Exported Macros
  * @{
  */
/** @defgroup COMP_LL_EM_WRITE_READ Common write and read registers macro
  * @{
  */

/**
  * @brief  Write a value in COMP register
  * @param  __INSTANCE__ comparator instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_COMP_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in COMP register
  * @param  __INSTANCE__ comparator instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_COMP_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/** @defgroup COMP_LL_EM_HELPER_MACRO COMP helper macro
  * @{
  */

/**
  * @brief  Helper macro to select the COMP common instance
  *         to which is belonging the selected COMP instance.
  * @note   COMP common register instance can be used to
  *         set parameters common to several COMP instances.
  *         Refer to functions having argument "COMPxy_COMMON" as parameter.
  * @param  __COMPx__ COMP instance
  * @retval COMP common instance or value "0" if there is no COMP common instance.
  */
#define __LL_COMP_COMMON_INSTANCE(__COMPx__)                                   \
  (COMP12_COMMON)

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup COMP_LL_Exported_Functions COMP Exported Functions
  * @{
  */

/** @defgroup COMP_LL_EF_Configuration_comparator_common Configuration of COMP hierarchical scope: common to several COMP instances
  * @{
  */

/**
  * @brief  Set window mode of a pair of comparators instances
  *         (2 consecutive COMP instances odd and even COMP<x> and COMP<x+1>).
  * @rmtoll CSR      WNDWE          LL_COMP_SetCommonWindowMode
  * @param  COMPxy_COMMON Comparator common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __LL_COMP_COMMON_INSTANCE() )
  * @param  WindowMode This parameter can be one of the following values:
  *         @arg @ref LL_COMP_WINDOWMODE_DISABLE
  *         @arg @ref LL_COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON
  * @retval None
  */
__STATIC_INLINE void LL_COMP_SetCommonWindowMode(COMP_Common_TypeDef *COMPxy_COMMON, uint32_t WindowMode)
{
  MODIFY_REG(COMPxy_COMMON->CSR, COMP_CSR_WNDWE, WindowMode);
}

/**
  * @brief  Get window mode of a pair of comparators instances
  *         (2 consecutive COMP instances odd and even COMP<x> and COMP<x+1>).
  * @rmtoll CSR      WNDWE          LL_COMP_GetCommonWindowMode
  * @param  COMPxy_COMMON Comparator common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref __LL_COMP_COMMON_INSTANCE() )
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_WINDOWMODE_DISABLE
  *         @arg @ref LL_COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON
  */
__STATIC_INLINE uint32_t LL_COMP_GetCommonWindowMode(COMP_Common_TypeDef *COMPxy_COMMON)
{
  return (uint32_t)(READ_BIT(COMPxy_COMMON->CSR, COMP_CSR_WNDWE));
}

/**
  * @}
  */

/** @defgroup COMP_LL_EF_Configuration_comparator_modes Configuration of comparator modes
  * @{
  */

/**
  * @brief  Set comparator instance operating mode to adjust power and speed.
  * @rmtoll COMP2_CSR   SPEED           LL_COMP_SetPowerMode
  * @param  COMPx Comparator instance
  * @param  PowerMode This parameter can be one of the following values:
  *         @arg @ref LL_COMP_POWERMODE_MEDIUMSPEED   (1)
  *         @arg @ref LL_COMP_POWERMODE_ULTRALOWPOWER (1)
  *         
  *         (1) Available only on COMP instance: COMP2.
  * @retval None
  */
__STATIC_INLINE void LL_COMP_SetPowerMode(COMP_TypeDef *COMPx, uint32_t PowerMode)
{
  MODIFY_REG(COMP->CSR, COMP_CSR_SPEED, PowerMode);
}

/**
  * @brief  Get comparator instance operating mode to adjust power and speed.
  * @rmtoll COMP2_CSR   SPEED           LL_COMP_GetPowerMode
  * @param  COMPx Comparator instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_POWERMODE_MEDIUMSPEED   (1)
  *         @arg @ref LL_COMP_POWERMODE_ULTRALOWPOWER (1)
  *         
  *         (1) Available only on COMP instance: COMP2.
  */
__STATIC_INLINE uint32_t LL_COMP_GetPowerMode(COMP_TypeDef *COMPx)
{
  return (uint32_t)(READ_BIT(COMP->CSR, COMP_CSR_SPEED));
}

/**
  * @}
  */

/** @defgroup COMP_LL_EF_Configuration_comparator_inputs Configuration of comparator inputs
  * @{
  */

/**
  * @brief  Set comparator input plus (non-inverting).
  * @note   In case of comparator input selected to be connected to IO:
  *         GPIO pins are specific to each comparator instance.
  *         Refer to description of parameters or to reference manual.
  * @rmtoll RI       RI_ASCR1_CH    LL_COMP_SetInputPlus\n
  *         RI       RI_ASCR2_GR6   LL_COMP_SetInputPlus
  * @param  COMPx Comparator instance
  * @param  InputPlus This parameter can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_PLUS_NONE
  *         @arg @ref LL_COMP_INPUT_PLUS_IO1 (2)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO2 (2)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO3 (2)(5)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO4 (2)(5)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO5 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO6 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO7 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO8 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO9 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO10 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO11 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO12 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO13 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO14 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO15 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO16 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO17 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO18 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO19 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO20 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO21 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO22 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO23 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO24 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO25 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO26 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO27 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO28 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO29 (1)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO30 (1)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO31 (1)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO32 (1)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO33 (1)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP1 (1)(3)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP2 (1)(3)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP3 (1)(4)
  *         
  *         (1) Available only on COMP instance: COMP1. \n
  *         (2) Available only on COMP instance: COMP2. \n
  *         (3) Available on devices: STM32L100xB, STM32L151xB, STM32L152xB, STM32L100xBA, STM32L151xBA, STM32L152xBA, STM32L151xCA, STM32L151xD, STM32L152xCA, STM32L152xD, STM32L162xCA, STM32L162xD \n
  *         (4) Available on devices: STM32L151xCA, STM32L151xD, STM32L152xCA, STM32L152xD, STM32L162xCA, STM32L162xD \n
  *         (5) Available on devices: STM32L100xC, STM32L151xC, STM32L152xC, STM32L162xC, STM32L151xCA, STM32L151xD, STM32L152xCA, STM32L152xD, STM32L162xCA, STM32L162xD) || defined(STM32L151xE) || defined(STM32L151xDX, STM32L152xE, STM32L152xDX, STM32L162xE, STM32L162xDX
  * @retval None
  */
__STATIC_INLINE void LL_COMP_SetInputPlus(COMP_TypeDef *COMPx, uint32_t InputPlus)
{
  /* Set switch in routing interface (RI) register ASCR1 or ASCR2 */
  /* Note: If COMP instance COMP1 is selected, this function performs         */
  /*       necessary actions on routing interface:                            */
  /*        - close switch netween comparator 1 and switch matrix             */
  /*          (RI_ASCR1_VCOMP)                                                */
  /*        - enable IO switch control mode (RI_ASCR1_SCM)                    */
  /*          If ADC needs to be used afterwards, disable IO switch control   */
  /*          mode using function @ref LL_RI_DisableSwitchControlMode().      */
  register uint32_t *preg = ((uint32_t *)((uint32_t) ((uint32_t)(&(RI->ASCR1)) + ((__COMP_IS_INSTANCE_EVEN(COMPx)) << 2U))));
  
  MODIFY_REG(*preg,
             (RI_ASCR1_CH * __COMP_IS_INSTANCE_ODD(COMPx)) | (RI_ASCR2_GR6 * __COMP_IS_INSTANCE_EVEN(COMPx)),
             InputPlus | ((RI_ASCR1_VCOMP | RI_ASCR1_SCM) * __COMP_IS_INSTANCE_ODD(COMPx)));
}

/**
  * @brief  Get comparator input plus (non-inverting).
  * @note   In case of comparator input selected to be connected to IO:
  *         GPIO pins are specific to each comparator instance.
  *         Refer to description of parameters or to reference manual.
  * @rmtoll RI       RI_ASCR1_CH    LL_COMP_GetInputPlus\n
  *         RI       RI_ASCR2_GR6   LL_COMP_GetInputPlus
  * @param  COMPx Comparator instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_PLUS_NONE
  *         @arg @ref LL_COMP_INPUT_PLUS_IO1 (2)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO2 (2)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO3 (2)(5)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO4 (2)(5)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO5 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO6 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO7 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO8 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO9 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO10 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO11 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO12 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO13 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO14 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO15 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO16 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO17 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO18 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO19 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO20 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO21 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO22 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO23 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO24 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO25 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO26 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO27 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO28 (1)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO29 (1)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO30 (1)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO31 (1)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO32 (1)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_IO33 (1)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP1 (1)(3)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP2 (1)(3)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP3 (1)(4)
  *         
  *         (1) Available only on COMP instance: COMP1. \n
  *         (2) Available only on COMP instance: COMP2. \n
  *         (3) Available on devices: STM32L100xB, STM32L151xB, STM32L152xB, STM32L100xBA, STM32L151xBA, STM32L152xBA, STM32L151xCA, STM32L151xD, STM32L152xCA, STM32L152xD, STM32L162xCA, STM32L162xD \n
  *         (4) Available on devices: STM32L151xCA, STM32L151xD, STM32L152xCA, STM32L152xD, STM32L162xCA, STM32L162xD \n
  *         (5) Available on devices: STM32L100xC, STM32L151xC, STM32L152xC, STM32L162xC, STM32L151xCA, STM32L151xD, STM32L152xCA, STM32L152xD, STM32L162xCA, STM32L162xD) || defined(STM32L151xE) || defined(STM32L151xDX, STM32L152xE, STM32L152xDX, STM32L162xE, STM32L162xDX
  */
__STATIC_INLINE uint32_t LL_COMP_GetInputPlus(COMP_TypeDef *COMPx)
{
  /* Get switch state in routing interface (RI) register ASCR1 or ASCR2 */
  register uint32_t *preg = ((uint32_t *)((uint32_t) ((uint32_t)(&(RI->ASCR1)) + ((__COMP_IS_INSTANCE_EVEN(COMPx)) << 2U))));
  
  return (uint32_t)(READ_BIT(*preg,
                             (RI_ASCR1_CH * __COMP_IS_INSTANCE_ODD(COMPx)) | (RI_ASCR2_GR6 * __COMP_IS_INSTANCE_EVEN(COMPx))));
}

/**
  * @brief  Set comparator input minus (inverting).
  * @note   In case of comparator input selected to be connected to IO:
  *         GPIO pins are specific to each comparator instance.
  *         Refer to description of parameters or to reference manual.
  * @rmtoll CSR      COMP_CSR_INSEL LL_COMP_SetInputMinus
  * @param  COMPx Comparator instance
  * @param  InputMinus This parameter can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_MINUS_1_4VREFINT (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_1_2VREFINT (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_3_4VREFINT (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC1_CH1   (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC1_CH2   (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_IO1        (1)
  *         
  *         (1) Available only on COMP instance: COMP2.
  * @retval None
  */
__STATIC_INLINE void LL_COMP_SetInputMinus(COMP_TypeDef *COMPx, uint32_t InputMinus)
{
  /* On this STM32 serie, only COMP instance COMP1 input minus is fixed to   */
  /* VrefInt. Check of comparator instance is implemented to modify register  */
  /* only if COMP2 is selected.                                               */
  MODIFY_REG(COMP->CSR,
             COMP_CSR_INSEL * __COMP_IS_INSTANCE_EVEN(COMPx),
             InputMinus     * __COMP_IS_INSTANCE_EVEN(COMPx));
}

/**
  * @brief  Get comparator input minus (inverting).
  * @note   In case of comparator input selected to be connected to IO:
  *         GPIO pins are specific to each comparator instance.
  *         Refer to description of parameters or to reference manual.
  * @rmtoll CSR      COMP_CSR_INSEL LL_COMP_SetInputMinus
  * @param  COMPx Comparator instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_MINUS_1_4VREFINT (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_1_2VREFINT (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_3_4VREFINT (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC1_CH1   (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC1_CH2   (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_IO1        (1)
  *         
  *         (1) Available only on COMP instance: COMP2.
  */
__STATIC_INLINE uint32_t LL_COMP_GetInputMinus(COMP_TypeDef *COMPx)
{
  /* On this STM32 serie, only COMP instance COMP1 input minus is fixed to   */
  /* VrefInt. Check of comparator instance is implemented to return           */
  /* the comparator input plus depending on COMP instance selected.           */
  return (uint32_t)((READ_BIT(COMP->CSR, COMP_CSR_INSEL) * __COMP_IS_INSTANCE_EVEN(COMPx))
                     | (LL_COMP_INPUT_MINUS_VREFINT * __COMP_IS_INSTANCE_ODD(COMPx)));
}

/**
  * @brief  Set comparator input pulling resistor.
  * @rmtoll CSR      10KPU          LL_COMP_SetInputPullingResistor\n
  *         CSR      400KPU         LL_COMP_SetInputPullingResistor\n
  *         CSR      10KPD          LL_COMP_SetInputPullingResistor\n
  *         CSR      400KPD         LL_COMP_SetInputPullingResistor
  * @param  COMPx Comparator instance
  * @param  InputPullingResistor This parameter can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_MINUS_PULL_NO
  *         @arg @ref LL_COMP_INPUT_MINUS_PULL_UP_10K    (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_PULL_UP_400K   (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_PULL_DOWN_10K  (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_PULL_DOWN_400K (1)
  *         
  *         (1) Available only on COMP instance: COMP1.
  * @retval None
  */
__STATIC_INLINE void LL_COMP_SetInputPullingResistor(COMP_TypeDef *COMPx, uint32_t InputPullingResistor)
{
  /* On this STM32 serie, only COMP instance COMP1 has input pulling         */
  /* resistor. Check of comparator instance is implemented to modify register */
  /* only if COMP1 is selected.                                               */
  MODIFY_REG(COMP->CSR,
             (COMP_CSR_10KPU | COMP_CSR_400KPU | COMP_CSR_10KPD | COMP_CSR_400KPD) * __COMP_IS_INSTANCE_ODD(COMPx),
             InputPullingResistor * __COMP_IS_INSTANCE_ODD(COMPx));
}

