zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32l1xx/drivers/include/stm32l1xx_ll_comp.h
/**
  * @brief  Get comparator input pulling resistor.
  * @rmtoll CSR      10KPU          LL_COMP_SetInputPullingResistor\n
  *         CSR      400KPU         LL_COMP_SetInputPullingResistor\n
  *         CSR      10KPD          LL_COMP_SetInputPullingResistor\n
  *         CSR      400KPD         LL_COMP_SetInputPullingResistor
  * @param  COMPx Comparator instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_MINUS_PULL_NO
  *         @arg @ref LL_COMP_INPUT_MINUS_PULL_UP_10K    (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_PULL_UP_400K   (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_PULL_DOWN_10K  (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_PULL_DOWN_400K (1)
  *         
  *         (1) Available only on COMP instance: COMP1.
  */
__STATIC_INLINE uint32_t LL_COMP_GetInputPullingResistor(COMP_TypeDef *COMPx)
{
  /* On this STM32 serie, only COMP instance COMP1 has input pulling         */
  /* resistor. Check of comparator instance is implemented to return          */
  /* the comparator input pulling resistor depending on COMP instance         */
  /* selected.                                                                */
  /* On this STM32 serie, only COMP instance COMP1 input minus is fixed to   */
  /* VrefInt. Check of comparator instance is implemented to return           */
  /* the comparator input plus depending on COMP instance selected.           */
  return (uint32_t)((READ_BIT(COMP->CSR, (COMP_CSR_10KPU | COMP_CSR_400KPU | COMP_CSR_10KPD | COMP_CSR_400KPD)) * __COMP_IS_INSTANCE_ODD(COMPx))
                     | (LL_COMP_INPUT_MINUS_PULL_NO * __COMP_IS_INSTANCE_EVEN(COMPx)));
}

/**
  * @}
  */

/** @defgroup COMP_LL_EF_Configuration_comparator_output Configuration of comparator output
  * @{
  */

/**
  * @brief  Set comparator output selection.
  * @note   Availability of parameters of output selection to timer
  *         depends on timers availability on the selected device.
  * @rmtoll CSR      OUTSEL         LL_COMP_SetOutputSelection
  * @param  COMPx Comparator instance
  * @param  OutputSelection This parameter can be one of the following values:
  *         @arg @ref LL_COMP_OUTPUT_NONE
  *         @arg @ref LL_COMP_OUTPUT_TIM2_IC4      (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM2_OCREFCLR (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM3_IC4      (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM3_OCREFCLR (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM4_IC4      (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM4_OCREFCLR (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM10_IC1     (1)(2)
  *         
  *         (1) Parameter availability depending on timer availability
  *             on the selected device.
  *         (2) Available only on COMP instance: COMP2.
  * @retval None
  */
__STATIC_INLINE void LL_COMP_SetOutputSelection(COMP_TypeDef *COMPx, uint32_t OutputSelection)
{
  /* On this STM32 serie, only COMP instance COMP2 has feature output        */
  /* selection. Check of comparator instance is implemented to modify register*/
  /* only if COMP2 is selected.                                               */
  MODIFY_REG(COMP->CSR,
             COMP_CSR_OUTSEL * __COMP_IS_INSTANCE_EVEN(COMPx),
             OutputSelection * __COMP_IS_INSTANCE_EVEN(COMPx));
}

/**
  * @brief  Get comparator output selection.
  * @note   Availability of parameters of output selection to timer
  *         depends on timers availability on the selected device.
  * @rmtoll CSR      OUTSEL         LL_COMP_GetOutputSelection
  * @param  COMPx Comparator instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_OUTPUT_NONE
  *         @arg @ref LL_COMP_OUTPUT_TIM2_IC4      (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM2_OCREFCLR (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM3_IC4      (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM3_OCREFCLR (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM4_IC4      (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM4_OCREFCLR (1)(2)
  *         @arg @ref LL_COMP_OUTPUT_TIM10_IC1     (1)(2)
  *         
  *         (1) Parameter availability depending on timer availability
  *             on the selected device.
  *         (2) Available only on COMP instance: COMP2.
  */
__STATIC_INLINE uint32_t LL_COMP_GetOutputSelection(COMP_TypeDef *COMPx)
{
  /* On this STM32 serie, only COMP instance COMP2 has feature output        */
  /* selection. Check of comparator instance is implemented to return         */
  /* the comparator output depending on COMP instance selected.               */
  return (uint32_t)((READ_BIT(COMP->CSR, COMP_CSR_OUTSEL) * __COMP_IS_INSTANCE_EVEN(COMPx))
                     | (LL_COMP_OUTPUT_NONE * __COMP_IS_INSTANCE_ODD(COMPx)));
}

/**
  * @}
  */

/** @defgroup COMP_LL_EF_Operation Operation on comparator instance
  * @{
  */

/**
  * @brief  Enable comparator instance.
  * @note   After enable from off state, comparator requires a delay
  *         to reach reach propagation delay specification.
  *         Refer to device datasheet, parameter "tSTART".
  * @rmtoll CSR      COMP1EN        LL_COMP_Enable\n
  *         CSR      COMP_CSR_INSEL LL_COMP_Enable
  * @param  COMPx Comparator instance (1)
  *         
  *         (1) On this STM32 serie, the only COMP instance that can be enabled
  *             using this function is COMP1.
  *             COMP2 is enabled by setting input minus.
  *             Refer to function @ref LL_COMP_SetInputMinus().
  * @retval None
  */
__STATIC_INLINE void LL_COMP_Enable(COMP_TypeDef *COMPx)
{
  /* On this STM32 serie, only COMP instance COMP1 has a dedicated bit       */
  /* for comparator enable. Check of comparator instance is implemented       */
  /* to modify register only if COMP1 is selected.                            */
  SET_BIT(COMP->CSR, __COMP_IS_INSTANCE_ODD(COMPx) << LL_COMP_ENABLE_COMP1_BITOFFSET_POS);
}

/**
  * @brief  Disable comparator instance.
  * @note   On this STM32 serie, COMP2 is disabled by clearing input minus
  *         selection. If COMP2 must be enabled afterwards, input minus must
  *         be set. Refer to function @ref LL_COMP_SetInputMinus().
  * @rmtoll CSR      COMP1EN        LL_COMP_Disable\n
  *         CSR      COMP_CSR_INSEL LL_COMP_Disable
  * @param  COMPx Comparator instance
  * @retval None
  */
__STATIC_INLINE void LL_COMP_Disable(COMP_TypeDef *COMPx)
{
  /* Note: On this STM32 serie, COMP2 is enabled by setting input minus.     */
  /*       Refer to function @ref LL_COMP_SetInputMinus().                    */
  /*       To disable COMP2, bitfield of input minus selection is reset.      */
  CLEAR_BIT(COMP->CSR, (COMP_CSR_CMP1EN * __COMP_IS_INSTANCE_ODD(COMPx)) | (COMP_CSR_INSEL * __COMP_IS_INSTANCE_EVEN(COMPx)));
}

/**
  * @brief  Get comparator enable state
  *         (0: COMP is disabled, 1: COMP is enabled)
  * @rmtoll CSR      COMP1EN        LL_COMP_IsEnabled\n
  *         CSR      COMP_CSR_INSEL LL_COMP_IsEnabled
  * @param  COMPx Comparator instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_COMP_IsEnabled(COMP_TypeDef *COMPx)
{
  return (READ_BIT(COMP->CSR, (COMP_CSR_CMP1EN * __COMP_IS_INSTANCE_ODD(COMPx)) | (COMP_CSR_INSEL * __COMP_IS_INSTANCE_EVEN(COMPx))) != (0U));
}

/**
  * @brief  Read comparator instance output level.
  * @note   On this STM32 serie, comparator polarity is not settable
  *         and not inverted:
  *          - Comparator output is low when the input plus
  *            is at a lower voltage than the input minus
  *          - Comparator output is high when the input plus
  *            is at a higher voltage than the input minus
  * @rmtoll CSR      CMP1OUT        LL_COMP_ReadOutputLevel\n
  *         CSR      CMP2OUT        LL_COMP_ReadOutputLevel
  * @param  COMPx Comparator instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_OUTPUT_LEVEL_LOW
  *         @arg @ref LL_COMP_OUTPUT_LEVEL_HIGH
  */
__STATIC_INLINE uint32_t LL_COMP_ReadOutputLevel(COMP_TypeDef *COMPx)
{
  return (uint32_t)(READ_BIT(COMP->CSR,
                             ((__COMP_IS_INSTANCE_ODD(COMPx) << LL_COMP_OUTPUT_LEVEL_COMP1_BITOFFSET_POS) | (__COMP_IS_INSTANCE_EVEN(COMPx) << LL_COMP_OUTPUT_LEVEL_COMP2_BITOFFSET_POS)))
                    >> (LL_COMP_OUTPUT_LEVEL_COMP1_BITOFFSET_POS + ((LL_COMP_OUTPUT_LEVEL_COMP2_BITOFFSET_POS - LL_COMP_OUTPUT_LEVEL_COMP1_BITOFFSET_POS) * __COMP_IS_INSTANCE_EVEN(COMPx)))
                   );
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup COMP_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

ErrorStatus LL_COMP_DeInit(COMP_TypeDef *COMPx);
ErrorStatus LL_COMP_Init(COMP_TypeDef *COMPx, LL_COMP_InitTypeDef *COMP_InitStruct);
void        LL_COMP_StructInit(LL_COMP_InitTypeDef *COMP_InitStruct);

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* COMP1 || COMP2 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32L1xx_LL_COMP_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
